src/cf/Catalogs/СерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СерииНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.КатегорииНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Продан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКиЗГИСМ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерКиЗГИСМ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDTID</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RFIDTID</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDUser</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDEPC</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RFIDEPC</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EPCGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГИСМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредприятияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписьСкладскогоЖурналаВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПартииВЕТИС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/ДвиженияСерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ДвиженияСерииНоменклатуры</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОперацииСерийНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/Запасы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Запасы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДСИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КоррСтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррПартия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСпецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМВозврат</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересортицаЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксированнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗатратыНаВыпуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеПроводки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеремещениеВРозницуСуммовойУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДвижениеЧекаВОткрытойСмене</Name>
					<Comment>Для изолирования движений по оперативному проведению Чеков ККМ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/ТочностиУказанияСрокаГодности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТочностиУказанияСрокаГодности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СТочностьюДоДней</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СТочностьюДоЧасов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/СерииНоменклатуры/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ПравоДоступа("Редактирование", Метаданные.Справочники.Номенклатура) Тогда
		ТолькоПросмотр = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаШапкаЛеваяКолонка", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаГруппаНастройкиСерий", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КоманднаяПанель", "Доступность", Ложь);
	КонецЕсли;
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Владелец") Тогда
		
		НоменклатураВладелец = Параметры.Отбор.Владелец;
		ЭтоКатегория = ТипЗнч(НоменклатураВладелец) = Тип("СправочникСсылка.КатегорииНоменклатуры");
		ИспользоватьСерии = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураВладелец, "ИспользоватьСерииНоменклатуры");
		
		ПолитикаУчетаСерий = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураВладелец, "ПолитикаУчетаСерий");
		ИспользоватьУникальныеСерии = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураВладелец, "ИспользоватьУникальныеСерии");
		ИспользоватьСрокГодностиСерии = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураВладелец, "ИспользоватьСрокГодностиСерии");
		ИспользоватьДатуПроизводстваСерии = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураВладелец, "ИспользоватьДатуПроизводстваСерии");
		ТочностьУказанияСрокаГодностиСерии = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураВладелец, "ТочностьУказанияСрокаГодностиСерии");
		ИспользоватьСерииИзКатегории = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураВладелец, "ИспользоватьСерииИзКатегории");
		
		Если Не ЭтоКатегория Тогда
			
			КатегорияНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураВладелец, "КатегорияНоменклатуры");
			ПолитикаУчетаСерийИзКатегории = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КатегорияНоменклатуры, "ПолитикаУчетаСерий");
			
			ВКатегорииСерииПоКатегории = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КатегорияНоменклатуры, "ИспользоватьСерииИзКатегории");
			
			Если Не ВКатегорииСерииПоКатегории Тогда
				УдаляемыйЭлемент = Элементы.НастройкаИспользованияСерий.СписокВыбора.НайтиПоЗначению("ИзКатегории");
				Элементы.НастройкаИспользованияСерий.СписокВыбора.Удалить(УдаляемыйЭлемент);
			КонецЕсли;
			
			Если ИспользоватьСерииИзКатегории Тогда
				
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Владелец", КатегорияНоменклатуры);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПолитикиУчетаСерий, "Владелец", КатегорияНоменклатуры, ВидСравненияКомпоновкиДанных.Равно);
				
			Иначе
				
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Владелец", НоменклатураВладелец);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПолитикиУчетаСерий, "Владелец", НоменклатураВладелец, ВидСравненияКомпоновкиДанных.Равно);
				
			КонецЕсли;
			
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Владелец", НоменклатураВладелец);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПолитикиУчетаСерий, "Владелец", НоменклатураВладелец, ВидСравненияКомпоновкиДанных.Равно);
		КонецЕсли;
		
		ИмяРеквизитаТипНоменклатуры = ?(НЕ ЭтоКатегория, "ТипНоменклатуры", "ТипНоменклатурыПоУмолчанию");
		
		Если НоменклатураВладелец[ИмяРеквизитаТипНоменклатуры] = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат Тогда
			ЭтоПодарочныйСертификат = Истина;
		КонецЕсли;
		
		ОбновитьПереключательНастройкаИспользованияСерий();
		СформироватьНадписиНастроекСерийИзКатегории();
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры")
			И (НоменклатураВладелец[ИмяРеквизитаТипНоменклатуры] = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат
			Или НоменклатураВладелец[ИмяРеквизитаТипНоменклатуры] = Перечисления.ТипыНоменклатуры.Запас) Тогда
			СерииДоступны = Истина;
		КонецЕсли;
		
		ЕдиницаИзмеренияСрокаГодности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураВладелец, "ЕдиницаИзмеренияСрокаГодности");
		СрокГодности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураВладелец, "СрокГодности");
		
		НастройкиПоСкладамСформироватьЗаголовок();
			
		Если НЕ ЗначениеЗаполнено(НоменклатураВладелец)
			ИЛИ (НЕ НоменклатураВладелец[ИмяРеквизитаТипНоменклатуры] = Перечисления.ТипыНоменклатуры.Запас
			И НЕ НоменклатураВладелец[ИмяРеквизитаТипНоменклатуры] = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат) Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Серии номенклатуры хранятся только для запасов и подарочных сертификатов'");
			Элементы.Список.ТолькоПросмотр = Истина;
			
		// Наборы
		ИначеЕсли НЕ ЭтоКатегория И НоменклатураВладелец.ЭтоНабор Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Серии номенклатуры недоступны для наборов'");
			Элементы.Список.ТолькоПросмотр = Истина;
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НастройкаИспользованияСерий", "Доступность", НЕ ЭтаФорма.ТолькоПросмотр);
		
		КонецЕсли;
		
		Если Параметры.Свойство("ТолькоПросмотрФормы") И Параметры.ТолькоПросмотрФормы Тогда
			Элементы.НастройкаИспользованияСерий.Доступность = Ложь;
		КонецЕсли;
		
		УстановитьДоступностьЭлементовФормы();
		
	Иначе
		Элементы.ПраваяПанель.Видимость = Ложь;
		ИмяРеквизитаТипНоменклатуры = "ТипНоменклатуры";
	КонецЕсли;
	
	Если Параметры.Свойство("ПоказатьПроданные") Тогда
	    ПоказатьПроданные = Параметры.ПоказатьПроданные;
	Иначе	
		ПоказатьПроданные = Ложь;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьПроданные", ПоказатьПроданные);
	Элементы.Продан.Видимость = ПоказатьПроданные;
	
	// ПодключаемоеОборудование
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	// Конец ПодключаемоеОборудование
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//УНФ.ОтборыСписка
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, Список,,,,, Ложь);
	//Конец УНФ.ОтборыСписка
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Список.Отбор.Элементы.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если НЕ ЗавершениеРаботы Тогда
		//УНФ.ОтборыСписка
		СохранитьНастройкиОтборов();
		//Конец УНФ.ОтборыСписка
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			Данные = МенеджерОборудованияУНФКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр);
			ПолученыШтрихкоды(Данные);
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПроданныеПриИзменении(Элемент)
	
	Элементы.Продан.Видимость = ПоказатьПроданные;
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьПроданные", ПоказатьПроданные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолитикаУчетаСерийПриИзменении(Элемент)
	
	ФормаВладельца = ЭтаФорма.ВладелецФормы;
	
	Если ФормаВладельца <> Неопределено Тогда 
		
		СтруктураПроверки = ИзменениеПолитикиУчетаСерийВозможно();
		Если Не СтруктураПроверки.ИзменениеВозможно Тогда
			
			ПолитикаУчетаСерий = СтруктураПроверки.ПолитикаДоИзменения;
			ФормаВладельца.Объект.ПолитикаУчетаСерий = СтруктураПроверки.ПолитикаДоИзменения;
			
			Сообщение = Новый СообщениеПользователю;
			
			Если СтруктураПроверки.ЕстьДвиженияПоНоменклатуре Тогда
				ТекстСообщения = НСтр("ru = 'Номенклатура участвует в документах. Установка политики с типом - Управление остатками, запрещена.
				|Если необходимо ведение учета с новой политикой рекомендуем создать номенклатуру с соответствующими настройками'");
			ИначеЕсли ЭтоКатегория Тогда
				ТекстСообщения = НСтр("ru = 'Серии данной категории участвуют в документах. Изменение на политику другого типа запрещено.
				|Если необходимо ведение учета с новой политикой рекомендуем создать категорию с соответствующими настройками'");
			Иначе
				ТекстСообщения = НСтр("ru = 'Серии данной номенклатуры участвуют в документах. Изменение на политику другого типа запрещено.
				|Если необходимо ведение учета с новой политикой рекомендуем создать номенклатуру с соответствующими настройками'");
			КонецЕсли;
			
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
			
		Иначе
			ФормаВладельца.Объект.ПолитикаУчетаСерий = ПолитикаУчетаСерий;
		КонецЕсли;
		
		ФормаВладельца.Модифицированность = Истина;
		
		УстановитьДоступностьЭлементовФормы();
		УстановитьНадписьНастроекСерийПриРаботеССертификатами(ФормаВладельца);
		
		Оповестить("ИзменениеЗначенияПолитикаУчетаСерий");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСрокГодностиСерииПриИзменении(Элемент)
	
	ФормаВладельца = ЭтаФорма.ВладелецФормы;
	
	Если ФормаВладельца <> Неопределено Тогда 
		
		ФормаВладельца.Объект.ИспользоватьСрокГодностиСерии = ИспользоватьСрокГодностиСерии;
		ФормаВладельца.Модифицированность = Истина;
		
		Если ИспользоватьСрокГодностиСерии Тогда
			
			Если Не ЗначениеЗаполнено(ТочностьУказанияСрокаГодностиСерии) Тогда
				ТочностьУказанияСрокаГодностиСерии = ПредопределенноеЗначение("Перечисление.ТочностиУказанияСрокаГодности.СТочностьюДоДней");
				ФормаВладельца.Объект.ТочностьУказанияСрокаГодностиСерии = ТочностьУказанияСрокаГодностиСерии;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ЕдиницаИзмеренияСрокаГодности) Тогда
				ЕдиницаИзмеренияСрокаГодности = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Сутки");
				ФормаВладельца.Объект.ЕдиницаИзмеренияСрокаГодности = ЕдиницаИзмеренияСрокаГодности;
			КонецЕсли;
			
		КонецЕсли;
		
		УстановитьДоступностьЭлементовФормы();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьДатуПроизводстваСерииПриИзменении(Элемент)
	
	ФормаВладельца = ЭтаФорма.ВладелецФормы;
	
	Если ФормаВладельца <> Неопределено Тогда 
		ФормаВладельца.Объект.ИспользоватьДатуПроизводстваСерии = ИспользоватьДатуПроизводстваСерии;
		ФормаВладельца.Модифицированность = Истина;
		
		Если ИспользоватьДатуПроизводстваСерии Тогда
			
			Если Не ЗначениеЗаполнено(ТочностьУказанияСрокаГодностиСерии) Тогда
				ТочностьУказанияСрокаГодностиСерии = ПредопределенноеЗначение("Перечисление.ТочностиУказанияСрокаГодности.СТочностьюДоДней");
				ФормаВладельца.Объект.ТочностьУказанияСрокаГодностиСерии = ТочностьУказанияСрокаГодностиСерии;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ЕдиницаИзмеренияСрокаГодности) Тогда
				ЕдиницаИзмеренияСрокаГодности = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Сутки");
				ФормаВладельца.Объект.ЕдиницаИзмеренияСрокаГодности = ЕдиницаИзмеренияСрокаГодности;
			КонецЕсли;
			
		КонецЕсли;
		
		УстановитьДоступностьЭлементовФормы();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТочностьУказанияСрокаГодностиСерииПриИзменении(Элемент)
	
	ФормаВладельца = ЭтаФорма.ВладелецФормы;
	
	Если ФормаВладельца <> Неопределено Тогда 
		ФормаВладельца.Объект.ТочностьУказанияСрокаГодностиСерии = ТочностьУказанияСрокаГодностиСерии;
		ФормаВладельца.Модифицированность = Истина;
		
		УстановитьДоступностьЭлементовФормы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СрокГодностиПриИзменении(Элемент)
	
	ФормаВладельца = ЭтаФорма.ВладелецФормы;
	
	Если ФормаВладельца <> Неопределено Тогда
		
		Если Не ФормаВладельца.Объект.СрокГодности = 0
			И Не ФормаВладельца.Объект.СрокГодности = СрокГодности И ИспользоватьСрокГодностиСерии Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Была изменена длительность срока годности. Проверьте окончание срока годности в сериях.'");
			Сообщение.Сообщить();
			
		КонецЕсли; 
		
		ФормаВладельца.Объект.СрокГодности = СрокГодности;
		ФормаВладельца.Модифицированность = Истина;
		УстановитьДоступностьЭлементовФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияСрокаГодностиПриИзменении(Элемент)
	
	ФормаВладельца = ЭтаФорма.ВладелецФормы;
	
	Если ФормаВладельца <> Неопределено Тогда 
		ФормаВладельца.Объект.ЕдиницаИзмеренияСрокаГодности = ЕдиницаИзмеренияСрокаГодности;
		ФормаВладельца.Модифицированность = Истина;
		УстановитьДоступностьЭлементовФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьУникальныеСерииПриИзменении(Элемент)
	
	ФормаВладельца = ЭтаФорма.ВладелецФормы;
	
	Если ФормаВладельца <> Неопределено Тогда 
		ФормаВладельца.Объект.ИспользоватьУникальныеСерии = ИспользоватьУникальныеСерии;
		ФормаВладельца.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьОтборыНажатие(Элемент)
	НовоеЗначениеВидимость = НЕ Элементы.ФильтрыНастройкиИДопИнфо.Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияРазвернутьОтборыНажатие(Элемент)
	НовоеЗначениеВидимость = НЕ Элементы.ФильтрыНастройкиИДопИнфо.Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость);
КонецПроцедуры

&НаКлиенте
Процедура ПолитикиУчетаСерийПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ПолитикиУчетаСерий.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	СтруктураДанных = Новый Структура("Организация, СтруктурнаяЕдиница, ПолитикаУчетаСерий");
	СтруктураДанных.Организация = ТекущиеДанные.Организация;
	СтруктураДанных.СтруктурнаяЕдиница = ТекущиеДанные.СтруктурнаяЕдиница;
	СтруктураДанных.ПолитикаУчетаСерий = ТекущиеДанные.ПолитикаУчетаСерий;
	
	Если Не УдалениеПолитикиУчетаСерийВозможно(СтруктураДанных) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Серии данной номенклатуры участвуют в документах. Удаление индивидуальной настройки запрещено.
		|Если необходимо ведение учета с новой настройкой рекомендуем создать номенклатуру с новыми настройками'");
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаИспользованияСерийПриИзменении(Элемент)
	
	ОтказПоПроверке = Ложь;
	Если Не ЭтоКатегория Тогда
		
		РезультатПроверки = СерииНоменклатурыУНФВызовСервера.ИзменениеИспользованияСерийПоНоменклатуреВозможно(НоменклатураВладелец, НастройкаИспользованияСерий);
		
		Если РезультатПроверки.ОтказПоНастройкамСерий Тогда
			
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = НСтр("ru = 'В категории установлена настройка учета серий - Общие для категории. Изменение на индивидуальные настройки запрещено.
			|Для ведения учета с новыми настройками (если по номенклатуре нет движений по сериям) перенесите номенклатуру в другую категорию.'");
			
			Сообщение.Сообщить();
			
			ОбновитьПереключательНастройкаИспользованияСерий();
			
			Возврат;
			
		КонецЕсли;
		
		ОтказПоПроверке = РезультатПроверки.ОтказПоДвижениямПоСериям Или РезультатПроверки.ОтказПоПолитике;
		
	ИначеЕсли ИспользоватьСерииИзКатегории Или НастройкаИспользованияСерий = "ИзКатегории" Тогда
		
		РезультатПроверки = СерииНоменклатурыУНФВызовСервера.ИзменениеИспользованияСерийПоКатегоииВозможно(НоменклатураВладелец, НастройкаИспользованияСерий);
		
		Если РезультатПроверки.ОтказПоНастройкамСерийИндивидуальные Или РезультатПроверки.ОтказПоНастройкамСерийОбщиеПоКатегории Тогда
			
			Сообщение = Новый СообщениеПользователю;
			
			Если РезультатПроверки.ОтказПоНастройкамСерийОбщиеПоКатегории Тогда
				Сообщение.Текст = НСтр("ru = 'Запрещено изменение на настройку - Общие для категории. Существует подчиненная номенклатура с индивидуальными настройками.'");
			Иначе
				Сообщение.Текст = НСтр("ru = 'Запрещено изменение на настройку - Индивидуальные. Существует подчиненная номенклатура с настройкой - Общие для категории.'");
			КонецЕсли;
			
			Сообщение.Сообщить();
			ОбновитьПереключательНастройкаИспользованияСерий();
			
			Возврат;
			
		КонецЕсли;
		
		ОтказПоПроверке = РезультатПроверки.ОтказПоДвижениямПоСериям;
	КонецЕсли;
	
	Если (НастройкаИспользованияСерий = "НеИспользуются" И ОтказПоПроверке)
		Или (НастройкаИспользованияСерий = "Индивидуальные" И ИспользоватьСерииИзКатегории И ОтказПоПроверке)
		Или (НастройкаИспользованияСерий = "ИзКатегории" И Не ИспользоватьСерииИзКатегории И ОтказПоПроверке) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		
		Если Не ЭтоКатегория Тогда
			
			Если РезультатПроверки.ОтказПоДвижениямПоСериям Тогда
				Сообщение.Текст = НСтр("ru = 'Серии номенклатуры участвуют в документах. Изменение запрещено.
				|Для ведения учета с новыми настройками по сериям необходимо создать новую номенклатуру.'");
			Иначе
				Сообщение.Текст = НСтр("ru = 'Тип политики учета серий в категории - Управление остатками. Номенклатура участвует в документах. Изменение запрещено.
				|Для ведения учета с новыми настройками по сериям необходимо создать новую номенклатуру.'");
			КонецЕсли;
			
		Иначе
			Сообщение.Текст = НСтр("ru = 'Серии категории участвуют в документах. Изменение запрещено.
			|Для ведения учета с новыми настройками по сериям необходимо создать новую категорию.'");
		КонецЕсли;
		
		Сообщение.Сообщить();
		
		ОбновитьПереключательНастройкаИспользованияСерий();
		
		Возврат;
		
	КонецЕсли;
	
	Если НастройкаИспользованияСерий = "НеИспользуются" Тогда
		ИспользоватьСерии = Ложь;
		ИспользоватьСерииИзКатегории = Ложь;
	ИначеЕсли НастройкаИспользованияСерий = "Индивидуальные" Тогда
		ИспользоватьСерии = Истина;
		ИспользоватьСерииИзКатегории = Ложь;
	Иначе
		ИспользоватьСерии = Истина;
		ИспользоватьСерииИзКатегории = Истина;
	КонецЕсли;
	
	ФормаВладельца = ВладелецФормы;
	
	Если ФормаВладельца <> Неопределено Тогда 
		ФормаВладельца.Объект.ИспользоватьСерииНоменклатуры = ИспользоватьСерии;
		ФормаВладельца.Объект.ИспользоватьСерииИзКатегории = ИспользоватьСерииИзКатегории;
		ФормаВладельца.Модифицированность = Истина;
		
		Если ФормаВладельца.Объект[ИмяРеквизитаТипНоменклатуры] = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПодарочныйСертификат") Тогда
			ИспользоватьУникальныеСерии = ИспользоватьСерии;
			ФормаВладельца.Объект.ИспользоватьУникальныеСерии = ИспользоватьУникальныеСерии;
		КонецЕсли;
		
		Если Не ИспользоватьСерии Тогда
			ПолитикаУчетаСерий = Неопределено;
			ФормаВладельца.Объект.ПолитикаУчетаСерий = Неопределено;
			ТочностьУказанияСрокаГодностиСерии = Неопределено;
			ФормаВладельца.Объект.ТочностьУказанияСрокаГодностиСерии = Неопределено;
			СрокГодности = 0;
			ФормаВладельца.Объект.СрокГодности = 0;
			ЕдиницаИзмеренияСрокаГодности = Неопределено;
			ФормаВладельца.Объект.ЕдиницаИзмеренияСрокаГодности = Неопределено;
		КонецЕсли; 
		
		Если Не ЭтоКатегория Тогда
			
			Если ИспользоватьСерииИзКатегории Тогда
				
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Владелец", КатегорияНоменклатуры);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПолитикиУчетаСерий, "Владелец", КатегорияНоменклатуры, ВидСравненияКомпоновкиДанных.Равно);
				
			Иначе
				
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Владелец", НоменклатураВладелец);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПолитикиУчетаСерий, "Владелец", НоменклатураВладелец, ВидСравненияКомпоновкиДанных.Равно);
				
			КонецЕсли;
			
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Владелец", НоменклатураВладелец);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПолитикиУчетаСерий, "Владелец", НоменклатураВладелец, ВидСравненияКомпоновкиДанных.Равно);
		КонецЕсли;
		
		УстановитьДоступностьЭлементовФормы();
		УстановитьНадписьНастроекСерийПриРаботеССертификатами(ФормаВладельца);
		СформироватьНадписиНастроекСерийИзКатегории();
		НастройкиПоСкладамСформироватьЗаголовок();
		Оповестить("ИзменениеЗначенияИспользоватьСерии");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолитикаУчетаСерийИзКатегорииПриИзменении(Элемент)
	
	ФормаВладельца = ЭтаФорма.ВладелецФормы;
	
	Если ФормаВладельца <> Неопределено Тогда 
		
		СтруктураПроверки = ИзменениеПолитикиУчетаСерийВозможно();
		Если Не СтруктураПроверки.ИзменениеВозможно Тогда
			
			ПолитикаУчетаСерий = СтруктураПроверки.ПолитикаДоИзменения;
			ФормаВладельца.Объект.ПолитикаУчетаСерий = СтруктураПроверки.ПолитикаДоИзменения;
			
			Сообщение = Новый СообщениеПользователю;
			
			Если СтруктураПроверки.ЕстьДвиженияПоНоменклатуре Тогда
				ТекстСообщения = НСтр("ru = 'Номенклатура участвует в движениях. Установка политики с типом - Управление остатками, запрещена.
				|Если необходимо ведение учета с новой политикой рекомендуем создать номенклатуру с соответствующими настройками.'");
			Иначе
				ТекстСообщения = НСтр("ru = 'Серии номенклатуры участвуют в документах. Изменение на политику другого типа запрещено.
				|Если необходимо ведение учета с новой политикой рекомендуем создать номенклатуру с соответствующими настройками.'");
			КонецЕсли;
			
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
			
		Иначе
			ФормаВладельца.Объект.ПолитикаУчетаСерий = ПолитикаУчетаСерий;
		КонецЕсли;
		
		ФормаВладельца.Модифицированность = Истина;
		
		УстановитьДоступностьЭлементовФормы();
		УстановитьНадписьНастроекСерийПриРаботеССертификатами(ФормаВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКомандФормы

&НаКлиенте
Процедура СоздатьШтрихкоды(Команда)
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выделите строки для создания соответствующих штрихкодов'"));
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("СоздатьШтрихкодыПродолжение", ЭтотОбъект);
	ТекстВопроса = СформироватьТекстВопросаДляСозданияШК();
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да, "Продолжить");
	Кнопки.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
	ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСоздать(Команда)
	
	ЗначенияЗаполнения = Новый Структура("Владелец", НоменклатураВладелец);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ПараметрыОткрытия.Вставить("СрокГодности", ИспользоватьСрокГодностиСерии);
	ПараметрыОткрытия.Вставить("ДатаПроизводства", ИспользоватьДатуПроизводстваСерии);
	ПараметрыОткрытия.Вставить("ПолитикаУчетаСерий", ПолитикаУчетаСерий);
	
	ОткрытьФорму("Справочник.СерииНоменклатуры.Форма.ФормаЭлемента", ПараметрыОткрытия, Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПроданные(Команда)
	
	ПоказатьПроданные = Не ПоказатьПроданные;
	Элементы.Продан.Видимость = ПоказатьПроданные;
	Список.Параметры.УстановитьЗначениеПараметра("ПоказатьПроданные", ПоказатьПроданные);
	
	Элементы.СписокПоказатьПереданные.Пометка = ПоказатьПроданные;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
КонецПроцедуры

#КонецОбласти

#Область ПодключаемоеОборудование

// Процедура обрабатывает полученные штрихкоды.
//
&НаКлиенте
Процедура ПолученыШтрихкоды(ДанныеШтрихкодов)

	Если Не ИспользоватьСерии Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Для номенклатуры не ведется учет по сериям.
							   |Установите флаг ""Использовать серии номенклатуры"" в карточке номенклатуры.'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	Для Каждого элОтбора Из Список.Отбор.Элементы Цикл
		Если элОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец") Тогда
			НоменклатураВладелец = элОтбора.ПравоеЗначение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Не ЗначениеЗаполнено(НоменклатураВладелец) И Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		НоменклатураВладелец = Элементы.Список.ТекущиеДанные.Владелец;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НоменклатураВладелец) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеШтрихкодов) = Тип("Массив") Тогда
		МассивШтрихкодов = ДанныеШтрихкодов;
	Иначе
		МассивШтрихкодов = Новый Массив;
		МассивШтрихкодов.Добавить(ДанныеШтрихкодов);
	КонецЕсли; 
	Для Каждого ТекШтрихкод Из МассивШтрихкодов Цикл
		ТекШтрихкод.Штрихкод = ШтрихкодированиеУНФКлиент.ПредставлениеШтрихкодаБезРазделителяGS1(ТекШтрихкод.Штрихкод);
	КонецЦикла;
	
	Серия = ПолучитьСерияПоШтрихкоду(ДанныеШтрихкодов, НоменклатураВладелец);
	Если ЗначениеЗаполнено(Серия) Тогда

		Элементы.Список.ТекущаяСтрока = Серия;
		ОткрытьФорму("Справочник.СерииНоменклатуры.ФормаОбъекта", Новый Структура("Ключ", Серия), ЭтотОбъект);
	Иначе

		НеДобавленныеШтрихкоды = ЗаполнитьПоДаннымШтрихКодов(ДанныеШтрихкодов);
		НеизвестныеШтрихкоды = НеДобавленныеШтрихкоды.НеизвестныеШтрихкоды;
		ШтрихкодыНекорректногоТипа = НеДобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;

		ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);

		Если НеизвестныеШтрихкоды.Количество() > 0 Тогда

			Оповещение = Новый ОписаниеОповещения("ПолученыШтрихкодыЗавершение", ЭтотОбъект, НеизвестныеШтрихкоды);

			ОткрытьФорму(
				"РегистрСведений.ШтрихкодыНоменклатуры.Форма.РегистрацияШтрихКодовНоменклатуры",
				Новый Структура("НеизвестныеШтрихкоды", НеизвестныеШтрихкоды), ЭтотОбъект, , , , Оповещение);

			Возврат;

		КонецЕсли;

		ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьПоДаннымШтрихКодов(ДанныеШтрихкодов)
	
	НеизвестныеШтрихкоды = Новый Массив;
	ШтрихкодыНекорректногоТипа = Новый Массив;
	
	Если ТипЗнч(ДанныеШтрихкодов) = Тип("Массив") Тогда
		МассивШтрихКодов = ДанныеШтрихкодов;
	Иначе
		МассивШтрихКодов = Новый Массив;
		МассивШтрихКодов.Добавить(ДанныеШтрихкодов);
	КонецЕсли;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("МассивШтрихКодов", МассивШтрихКодов);
	СтруктураДанные.Вставить("ОтборТипНоменклатуры", ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас"));

	ПолучитьДанныеПоШтрихКодам(СтруктураДанные);
	
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихКодов Цикл
		ДанныеШтрихкода = СтруктураДанные.ДанныеПоШтрихкодам[ТекШтрихкод.Штрихкод];
		
		Если ДанныеШтрихкода <> Неопределено
		   И ДанныеШтрихкода.Количество() = 0 Тогда
		   
		    ТекШтрихкод.Вставить("Номенклатура", НоменклатураВладелец);
			НеизвестныеШтрихкоды.Добавить(ТекШтрихкод);
			
		ИначеЕсли СтруктураДанные.ОтборТипНоменклатуры <> ДанныеШтрихкода.ТипНоменклатуры Тогда
			ШтрихкодыНекорректногоТипа.Добавить(Новый Структура("Штрихкод,Номенклатура,ТипНоменклатуры", ТекШтрихкод.Штрихкод, ДанныеШтрихкода.Номенклатура, ДанныеШтрихкода.ТипНоменклатуры));
		ИначеЕсли ДанныеШтрихкода.Номенклатура = НоменклатураВладелец Тогда
			
			Если НЕ ЗначениеЗаполнено(ДанныеШтрихкода.Серия) Тогда
				НовыйСерия = СоздатьСерия(ТекШтрихкод.Штрихкод, НоменклатураВладелец);
				Если ЗначениеЗаполнено(НовыйСерия) Тогда
					ОповеститьОбИзменении(НовыйСерия);
				КонецЕсли;
				
				Элементы.Список.ТекущаяСтрока = НовыйСерия;
			Иначе
				Элементы.Список.ТекущаяСтрока = ДанныеШтрихкода.Серия;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("НеизвестныеШтрихкоды, ШтрихкодыНекорректногоТипа",НеизвестныеШтрихкоды, ШтрихкодыНекорректногоТипа);
	
КонецФункции // ЗаполнитьПоДаннымШтрихКодов()

&НаСервере
Функция СоздатьСерия(СерияСтрока, НоменклатураВладелец)

	Об = Справочники.СерииНоменклатуры.СоздатьЭлемент();
	Об.Владелец = НоменклатураВладелец;
	Об.Наименование = СерияСтрока;
	
	Попытка
		Об.Записать();
		
		СтрокаСообщения = НСтр("ru = 'Создан серийный номер: %1%'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", СерияСтрока);
		ОбщегоНазначения.СообщитьПользователю(СтрокаСообщения);
	Исключение
	    ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Об.Ссылка;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПолучитьДанныеПоШтрихКодам(СтруктураДанные)
	
	ДанныеПоШтрихКодам = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьДанныеПоШтрихкодам(СтруктураДанные.МассивШтрихКодов);
	
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихКодов Цикл
		
		ДанныеШтрихкода = ДанныеПоШтрихкодам[ТекШтрихкод.Штрихкод];
		
		Если ДанныеШтрихкода <> Неопределено
		   И ДанныеШтрихкода.Количество() <> 0 Тогда
			
			Если НЕ ЗначениеЗаполнено(ДанныеШтрихкода.ЕдиницаИзмерения) Тогда
				ДанныеШтрихкода.ЕдиницаИзмерения  = ДанныеШтрихкода.Номенклатура.ЕдиницаИзмерения;
			КонецЕсли;
			ДанныеШтрихкода.Вставить("ТипНоменклатуры", ДанныеШтрихкода.Номенклатура.ТипНоменклатуры);
			Если ЗначениеЗаполнено(ДанныеШтрихкода.ЕдиницаИзмерения)
				И ТипЗнч(ДанныеШтрихкода.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
				ДанныеШтрихкода.Вставить("Коэффициент", ДанныеШтрихкода.ЕдиницаИзмерения.Коэффициент);
			Иначе
				ДанныеШтрихкода.Вставить("Коэффициент", 1);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДанные.Вставить("ДанныеПоШтрихКодам", ДанныеПоШтрихКодам);
	
КонецПроцедуры // ПолучитьДанныеПоШтрихКодам()

&НаСервереБезКонтекста
Функция ПолучитьСерияПоШтрихкоду(ДанныеШтрихкода, НоменклатураВладелец)

	СтрокаШтрихкод = ДанныеШтрихкода[0].Штрихкод;
	ДанныеСН = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьДанныеПоШтрихкодам(ДанныеШтрихкода);
	
	ЗаписанныеДанныеШтрихкода = ДанныеСН[СтрокаШтрихкод];
	Если ЗаписанныеДанныеШтрихкода.Количество() = 0 Тогда
		
		Возврат Неопределено;
	ИначеЕсли ЗаписанныеДанныеШтрихкода.Номенклатура = НоменклатураВладелец Тогда
		
		Возврат ЗаписанныеДанныеШтрихкода.Серия;
	Иначе	
		СтрокаСообщения = НСтр("ru = 'Введенный штрихкод %1% привязан к другой номенклатуре (серии номенклатуры): %2%'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", СтрокаШтрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ЗаписанныеДанныеШтрихкода.Номенклатура);
		ОбщегоНазначения.СообщитьПользователю(СтрокаСообщения);
		
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Процедура - обработчик команды командной панели табличной части.
&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	ТекШтрихкод = "";
	
	ОбработкаЗавершения = Новый ОписаниеОповещения(
		"ПоискПоШтрихкодуЗавершение",
		ЭтотОбъект, 
		Новый Структура("ТекШтрихкод", ТекШтрихкод));
	
	#Если МобильныйКлиент Тогда
		ОткрытьФорму("ОбщаяФорма.ФормаПоискаПоШтрихкоду",,,,,,ОбработкаЗавершения);
	#Иначе
		ПоказатьВводЗначения(ОбработкаЗавершения, ТекШтрихкод, НСтр("ru = 'Введите штрихкод'"));
	#КонецЕсли
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОценкаПроизводительностиКлиент.ЗамерВремени(СтрШаблон("ПоискПоШтрихкоду%1",
		РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ИмяФормы)));
	
	ТекШтрихкод = ?(Результат = Неопределено, СокрЛП(ДополнительныеПараметры.ТекШтрихкод), СокрЛП(Результат));
	
	Если НЕ ПустаяСтрока(ТекШтрихкод) Тогда
		МассивШтрихКодов = Новый Массив;
		МассивШтрихКодов.Добавить(Новый Структура("Штрихкод, Количество", ТекШтрихкод, 1));
		ПолученыШтрихкоды(МассивШтрихКодов);
	КонецЕсли;
	
КонецПроцедуры // ПоискПоШтрихкоду()

&НаКлиенте
Процедура ПолученыШтрихкодыЗавершение(ВозвращаемыеПараметры, Параметры) Экспорт
	
	НеизвестныеШтрихкоды = Параметры;
	
	Если ВозвращаемыеПараметры <> Неопределено Тогда
		
		МассивШтрихКодов = Новый Массив;
		
		Для каждого ЭлементМассива Из ВозвращаемыеПараметры.ЗарегистрированныеШтрихкоды Цикл
			МассивШтрихКодов.Добавить(ЭлементМассива);
		КонецЦикла;
		
		Для каждого ЭлементМассива Из ВозвращаемыеПараметры.ПолученыНовыеШтрихкоды Цикл
			МассивШтрихКодов.Добавить(ЭлементМассива);
		КонецЦикла;
		
		НеДобавленныеШтрихкоды		= ЗаполнитьПоДаннымШтрихКодов(МассивШтрихКодов);
		НеизвестныеШтрихкоды		= НеДобавленныеШтрихкоды.НеизвестныеШтрихкоды;
		ШтрихкодыНекорректногоТипа	= НеДобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;
		ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	КонецЕсли;
	
	ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды) Экспорт
	
	Для каждого ТекНеизвестныйШтрихкод Из НеизвестныеШтрихкоды Цикл
		
		СтрокаСообщения = НСтр("ru = 'Данные по штрихкоду не найдены: %1%; количество: %2%'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНеизвестныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНеизвестныйШтрихкод.Количество);
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа) Экспорт
	
	Для каждого ТекНекорректныйШтрихкод Из ШтрихкодыНекорректногоТипа Цикл
		
		СтрокаСообщения = НСтр("ru = 'Найденная по штрихкоду %1% номенклатура -%2%- имеет тип %3%, который не подходит для этой табличной части'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНекорректныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНекорректныйШтрихкод.Номенклатура);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%3%", ТекНекорректныйШтрихкод.ТипНоменклатуры);
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти //ПодключаемоеОборудование

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьНадписиНастроекСерийИзКатегории();
	
	Если Не ИспользоватьСерииИзКатегории 
		Или Не ТипЗнч(НоменклатураВладелец) = Тип("СправочникСсылка.Номенклатура") Тогда
		Возврат;
	КонецЕсли;
	
	КатегорияНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураВладелец, "КатегорияНоменклатуры");
	
	МассивЭлементовСтроки = Новый Массив;
	
	МассивЭлементовСтроки.Добавить(?(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КатегорияНоменклатуры, "ИспользоватьУникальныеСерии"),НСтр("ru = 'серийным номерам'"), ""));
	МассивЭлементовСтроки.Добавить(?(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КатегорияНоменклатуры, "ИспользоватьСрокГодностиСерии"), НСтр("ru = 'срокам годности'"), ""));
	МассивЭлементовСтроки.Добавить(?(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КатегорияНоменклатуры, "ИспользоватьДатуПроизводстваСерии"), НСтр("ru = 'дате производства'"), ""));
	
	НастройкиСерийИзКатегории = "";

	Для Каждого ЭлементМассива Из МассивЭлементовСтроки Цикл
		
		Если НЕ ПустаяСтрока(НастройкиСерийИзКатегории) И Не ПустаяСтрока(ЭлементМассива) Тогда
			НастройкиСерийИзКатегории = НастройкиСерийИзКатегории + ", ";
		КонецЕсли;
		
		НастройкиСерийИзКатегории = НастройкиСерийИзКатегории + ЭлементМассива;
		
	КонецЦикла;
	
	КатегорияСрокГодности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КатегорияНоменклатуры, "СрокГодности");
	КатегорияЕдиницаИзмеренияСрокаГодности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КатегорияНоменклатуры, "ЕдиницаИзмеренияСрокаГодности");
	
	Если КатегорияЕдиницаИзмеренияСрокаГодности = Перечисления.ЕдиницыИзмеренияВремени.Год Тогда
		НастройкиСерийИзКатегорииСрокГодности = СтрокаСЧислом(";год;;года;лет;год", КатегорияСрокГодности, ВидЧисловогоЗначения.Количественное);
	ИначеЕсли КатегорияЕдиницаИзмеренияСрокаГодности = Перечисления.ЕдиницыИзмеренияВремени.Сутки Тогда
		НастройкиСерийИзКатегорииСрокГодности = СтрокаСЧислом(";день;;дня;дней;дня", КатегорияСрокГодности, ВидЧисловогоЗначения.Количественное);
	ИначеЕсли КатегорияЕдиницаИзмеренияСрокаГодности = Перечисления.ЕдиницыИзмеренияВремени.Месяц Тогда
		НастройкиСерийИзКатегорииСрокГодности = СтрокаСЧислом(";месяц;;месяца;месяцев;месяца", КатегорияСрокГодности, ВидЧисловогоЗначения.Количественное);
	КонецЕсли;
	
	Если КатегорияСрокГодности = 0 Тогда
		НастройкиСерийИзКатегорииСрокГодности = "";
	Иначе
		НастройкиСерийИзКатегорииСрокГодности = СтрШаблон(НСтр("ru = '%1 %2'"), Строка(
			КатегорияСрокГодности), НастройкиСерийИзКатегорииСрокГодности);
	КонецЕсли
	;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПереключательНастройкаИспользованияСерий();
	
	Если Не ИспользоватьСерии Тогда
		НастройкаИспользованияСерий = "НеИспользуются";
	ИначеЕсли ИспользоватьСерии И Не ИспользоватьСерииИзКатегории Тогда
		НастройкаИспользованияСерий = "Индивидуальные";
	Иначе
		НастройкаИспользованияСерий = "ИзКатегории";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьТекстВопросаДляСозданияШК()
	
	ТекстВопроса = НСтр("ru = 'По выделенным строкам будут созданы штрихкоды. Продолжить?'");
	
	Если ЗначениеЗаполнено(ПолитикаУчетаСерий) Тогда
		Если Не ПолитикаУчетаСерий.СоздаватьШК Тогда
			ТекстПредупреждения = Новый ФорматированнаяСтрока(
				НСтр("ru = 'В настройках политики учета серий можно включить автоматическое создание штрихкодов.'"),,
				ЦветаСтиля.ЦветТекстаПодсказки, ЦветаСтиля.ЦветФонаПодсказки);
			ТекстВопроса = Новый ФорматированнаяСтрока(ТекстВопроса, Символы.ПС, Символы.ПС, ТекстПредупреждения);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекстВопроса;
	
КонецФункции

&НаКлиенте
Процедура СоздатьШтрихкодыПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = НачатьСозданиеШтрихкодов();
	
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииСозданияШтрихкодов", ЭтотОбъект);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Выполняется создание штрихкодов'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьСозданиеШтрихкодов()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьШтрихкодыПоСериям",
		НоменклатураВладелец,
		Элементы.Список.ВыделенныеСтроки);
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииСозданияШтрихкодов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Если Результат.ЕстьОшибки Тогда
		Для Каждого Ошибка Из Результат.Сообщения Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Ошибка);
		КонецЦикла;
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Создание штрихкодов завершено'"));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНадписьНастроекСерийПриРаботеССертификатами(ФормаВладельца)
	
	Если ЭтоКатегория Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ФормаВладельца.Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПодарочныйСертификат") Тогда
		Возврат
	КонецЕсли;
	
	НастройкиВыполнены = ИспользоватьСерии И ЗначениеЗаполнено(ПолитикаУчетаСерий);
	ФормаВладельца.Элементы.НадписьСерииВведены.Видимость = НастройкиВыполнены;
	ФормаВладельца.Элементы.НадписьСерииНеВведены.Видимость = Не НастройкиВыполнены;
	
КонецПроцедуры

&НаСервере
Функция УдалениеПолитикиУчетаСерийВозможно(СтруктураДанных)
	
	Если Не ТипЗнч(НоменклатураВладелец) = Тип("СправочникСсылка.Номенклатура") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураВладелец);
	Запрос.УстановитьПараметр("Организация", СтруктураДанных.Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктураДанных.СтруктурнаяЕдиница);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДвиженияСерииНоменклатуры.Серия КАК Серия
	|ИЗ
	|	РегистрНакопления.ДвиженияСерииНоменклатуры КАК ДвиженияСерииНоменклатуры
	|ГДЕ
	|	ДвиженияСерииНоменклатуры.Номенклатура = &Номенклатура
	|	И НЕ ДвиженияСерииНоменклатуры.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	И ДвиженияСерииНоменклатуры.Организация = &Организация
	|	И ДвиженияСерииНоменклатуры.СтруктурнаяЕдиница = &СтруктурнаяЕдиница";
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервере
Функция ИзменениеПолитикиУчетаСерийВозможно(ПолитикаИзСсылки = Неопределено)
	
	Если ПолитикаИзСсылки = Неопределено Тогда
		ПолитикаИзСсылки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураВладелец, "ПолитикаУчетаСерий")
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("ИзменениеВозможно, ПолитикаДоИзменения, ЕстьДвиженияПоНоменклатуре");
	СтруктураВозврата.ЕстьДвиженияПоНоменклатуре = Ложь;
	
	Если ТипЗнч(НоменклатураВладелец) = Тип("СправочникСсылка.Номенклатура") Или ТипЗнч(НоменклатураВладелец) = Тип("СправочникСсылка.КатегорииНоменклатуры") Тогда
		
		Если Не ЗначениеЗаполнено(ПолитикаИзСсылки) 
			Или ПолитикаИзСсылки.ТипПолитики = Перечисления.ТипыПолитикУказанияСерий.СправочноеУказаниеСерий Тогда
			
			Если ПолитикаУчетаСерий.ТипПолитики = Перечисления.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий Тогда
				
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("Номенклатура", НоменклатураВладелец);
				Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	Запасы.Номенклатура КАК Номенклатура
				|ИЗ
				|	РегистрНакопления.Запасы КАК Запасы
				|ГДЕ
				|	Запасы.Номенклатура = &Номенклатура";
				
				Если ЭтоКатегория И ИспользоватьСерииИзКатегории Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "Запасы.Номенклатура = &Номенклатура", "Запасы.Номенклатура.КатегорияНоменклатуры = &Номенклатура");
				КонецЕсли;
				
				ЗапросПустой = Запрос.Выполнить().Пустой();
				
				СтруктураВозврата.ИзменениеВозможно = ЗапросПустой;
				СтруктураВозврата.ЕстьДвиженияПоНоменклатуре = Не ЗапросПустой;
				СтруктураВозврата.ПолитикаДоИзменения = ?(ЗначениеЗаполнено(ПолитикаИзСсылки), ПолитикаИзСсылки, Неопределено);
			Иначе
				СтруктураВозврата.ИзменениеВозможно = Истина;
			КонецЕсли;
			
			Возврат СтруктураВозврата;
			
		КонецЕсли;
	Иначе
		СтруктураВозврата.ИзменениеВозможно = Истина;
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураВладелец);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДвиженияСерииНоменклатуры.Серия КАК Серия
	|ИЗ
	|	РегистрНакопления.ДвиженияСерииНоменклатуры КАК ДвиженияСерииНоменклатуры
	|ГДЕ
	|	ДвиженияСерииНоменклатуры.Номенклатура = &Номенклатура
	|	И НЕ ДвиженияСерииНоменклатуры.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)";
	
	Если ЭтоКатегория И ИспользоватьСерииИзКатегории Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДвиженияСерииНоменклатуры.Номенклатура = &Номенклатура", "ДвиженияСерииНоменклатуры.Номенклатура.КатегорияНоменклатуры = &Номенклатура");
	КонецЕсли;
	
	Если Запрос.Выполнить().Пустой() Тогда
		СтруктураВозврата.ИзменениеВозможно = Истина;
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Если Не ПолитикаИзСсылки.ТипПолитики = ПолитикаУчетаСерий.ТипПолитики Тогда
		СтруктураВозврата.ИзменениеВозможно = Ложь;
		СтруктураВозврата.ПолитикаДоИзменения = ПолитикаИзСсылки;
		Возврат СтруктураВозврата;
	Иначе
		СтруктураВозврата.ИзменениеВозможно = Истина;
		Возврат СтруктураВозврата;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	
	Если НЕ ИспользоватьСерии Тогда
		Элементы.ФормаПоискПоШтрихкоду.Доступность = Ложь;
		Элементы.ПоказатьПроданные.Доступность = Ложь;
	Иначе
		Элементы.ФормаПоискПоШтрихкоду.Доступность = Истина;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНастройкиПолитики", "Доступность", ИспользоватьСерии И Не ЭтоПодарочныйСертификат);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаПроизводства", "Видимость", ИспользоватьСерии И ИспользоватьДатуПроизводстваСерии);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГоденДо", "Видимость", ИспользоватьСерии И ИспользоватьСрокГодностиСерии);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСлева", "Доступность", ИспользоватьСерии);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПолитикаУчетаСерий", "АвтоОтметкаНезаполненного", ИспользоватьСерии);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПолитикаУчетаСерий", "Доступность", ИспользоватьСерии);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСрокГодности", "Доступность", 
	(ИспользоватьСерии И Не ЭтоПодарочныйСертификат) И (ИспользоватьСрокГодностиСерии Или ИспользоватьДатуПроизводстваСерии));
	
		ИспользоватьСерииИзКатегорииДляНоменклатуры = Не ЭтоКатегория И ИспользоватьСерииИзКатегории;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Список", "ТолькоПросмотр", ИспользоватьСерииИзКатегорииДляНоменклатуры);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПолитикиУчетаСерий", "ТолькоПросмотр", ИспользоватьСерииИзКатегорииДляНоменклатуры);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВладелецИзКатегории", "Видимость", ИспользоватьСерииИзКатегорииДляНоменклатуры);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаГруппаНастройкиСерийИзКатегории", "Видимость", ИспользоватьСерииИзКатегорииДляНоменклатуры);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПолитикаУчетаСерий", "Видимость", Не ИспользоватьСерииИзКатегорииДляНоменклатуры);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаГруппаНастройкиСерий", "Видимость", Не ИспользоватьСерииИзКатегорииДляНоменклатуры);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокСписокСоздать", "Видимость", Не ИспользоватьСерииИзКатегорииДляНоменклатуры);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокСкопировать", "Видимость", Не ИспользоватьСерииИзКатегорииДляНоменклатуры);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаФлажки", "Доступность", ИспользоватьСерии И Не ЭтоПодарочныйСертификат);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НастройкаИспользованияСерий", "Доступность", СерииДоступны);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЕдиницаИзмеренияСрокаГодности", "АвтоОтметкаНезаполненного", ЗначениеЗаполнено(СрокГодности) И Не ЗначениеЗаполнено(ЕдиницаИзмеренияСрокаГодности));
	Элементы.КоманднаяПанель.Доступность = ИспользоватьСерии;
	
	Если ЭтоКатегория Или (Не ЭтоКатегория И ИспользоватьСерии И ИспользоватьСерииИзКатегории) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаПоискПоШтрихкоду", "Видимость", Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаПоискПоШтрихкоду", "Видимость", Истина);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокСоздатьШтрихкоды", "Видимость", Не ЭтоКатегория);
	
	ВидимостьСпискаСерий = ЭтоКатегория И ИспользоватьСерииИзКатегории Или Не ЭтоКатегория;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КоманднаяПанель", "Видимость", ВидимостьСпискаСерий);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСписокСерии", "Видимость", ВидимостьСпискаСерий);
	
	Если ЗначениеЗаполнено(ТочностьУказанияСрокаГодностиСерии) Тогда
		Если ТочностьУказанияСрокаГодностиСерии = Перечисления.ТочностиУказанияСрокаГодности.СТочностьюДоДней Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаПроизводства", "Формат", "ДФ=дд.ММ.гггг");
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГоденДо", "Формат", "ДФ=дд.ММ.гггг");
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаПроизводства", "Формат", "ДФ='дд.ММ.гггг ЧЧ:мм'");
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГоденДо", "Формат", "ДФ='дд.ММ.гггг ЧЧ:мм'");
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаПроизводства", "Формат", "ДФ=дд.ММ.гггг");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГоденДо", "Формат", "ДФ=дд.ММ.гггг");
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") И Не ПолучитьФункциональнуюОпцию("УчетПоНесколькимСкладам") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНастройкиПолитики", "Видимость", Ложь);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПодарочныеСертификаты") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЧастичноеПогашение", "Доступность", ИспользоватьСерии);
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОтборов()
	
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект,,,,Ложь);
	
КонецПроцедуры

&НаСервере
Процедура НастройкиПоСкладамСформироватьЗаголовок()
	
	Запрос = Новый Запрос;
	
	Если ЭтоКатегория Тогда
		Запрос.УстановитьПараметр("Владелец", НоменклатураВладелец);
	Иначе
		
		Если ИспользоватьСерииИзКатегории Тогда
			Запрос.УстановитьПараметр("Владелец", КатегорияНоменклатуры);
		Иначе
			Запрос.УстановитьПараметр("Владелец", НоменклатураВладелец);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПолитикиУчетаСерий.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий
	|ИЗ
	|	РегистрСведений.ПолитикиУчетаСерий КАК ПолитикиУчетаСерий
	|ГДЕ
	|	ПолитикиУчетаСерий.Владелец = &Владелец";
	
	РезультатЗапросаПустой = Запрос.Выполнить().Пустой();
	
	ЗаголовокГруппы = "";
	
	Если ИспользоватьСерииИзКатегории Тогда
		Если Не РезультатЗапросаПустой Тогда
			ЗаголовокГруппы = НСтр("ru = 'Настройки по складам (Да)'");
		Иначе
			ЗаголовокГруппы = НСтр("ru = 'Настройки по складам (Нет)'")
		КонецЕсли;
	Иначе
		Если Не РезультатЗапросаПустой Тогда
			ЗаголовокГруппы = НСтр("ru = 'Индивидуальные настройки по складам (Да)'");
		Иначе
			ЗаголовокГруппы = НСтр("ru = 'Индивидуальные настройки по складам (Нет)'")
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ГруппаНастройкиПолитики.Заголовок = ЗаголовокГруппы;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
